import i18n from "i18next";
import { initReactI18next } from "react-i18next";

const resources = {
  en: {
    translation: {
      "О нас": "About Us",
      Контакты: "Contacts",
      Проекты: "Projects",
      "Управляем проектами — создаем": "We manage projects — we create",
      успех: "success",
      "Связаться с нами": "Contact Us",
      "Мы, команда профессионалов, реализуем внутренние и внешние проекты с максимальной эффективностью, используя современные подходы проектного управления":
        "We, a team of professionals, implement internal and external projects with maximum efficiency, using modern project management approaches",
      "Проектный офис КБТУ": "Project Office KBTU",
      "основанный в 2022 году, был создан как внутреннее подразделение университета с целью внедрения и продвижения современных практик и подходов проектного управления в его деятельности.":
        "founded in 2022, was created as an internal division of the university with the aim of implementing and promoting modern practices and approaches to project management in its activities.",
      "Наша миссия": "Our Mission",
      "Создавать и развивать проектную культуру в университете, внедряя передовые методы управления, способствующие устойчивому развитию и укреплению позиций вуза в образовательной и научной сферах.":
        "To create and develop a project culture at the university by implementing advanced management methods that contribute to sustainable development and strengthen the university's position in educational and scientific fields.",
      "Выступать центром компетенций в области проектного управления, поддерживая и развивая внутренние и внешние инициативы университета.":
        "To act as a center of competence in project management, supporting and developing internal and external initiatives of the university.",
      "Наши цели": "Our Goals",
      "Унификация процессов и повышение прозрачности":
        "Unification of processes and increasing transparency",
      "Внедрение единого стандарта управления проектами для обеспечения эффективности реализации, прозрачности всех этапов проектной деятельности и снижения рисков, связанных с реализацией проектов.":
        "Implementation of a unified project management standard to ensure the effectiveness of implementation, transparency of all stages of project activities, and reduction of risks associated with project implementation.",
      "Развитие культуры проектного управления":
        "Development of project management culture",
      "Формирование и укрепление культуры управления проектами в университете, способствующей повышению профессионального уровня сотрудников и улучшению результатов работы.":
        "Formation and strengthening of project management culture at the university, contributing to the improvement of professional level of employees and better work results.",
      "Внедрение передовых практик": "Implementation of best practices",
      "Анализ современных подходов и лучших мировых практик в области управления проектами, их адаптация и интеграция в процессы проектной деятельности КБТУ для достижения новых высот в управлении проектами.":
        "Analysis of modern approaches and best world practices in project management, their adaptation and integration into the project activities of KBTU to achieve new heights in project management.",
      "Факты и цифры": "Facts and Figures",
      "В ОУП работают сертифицированные проектные менеджеры (IPMA), обладающие практическим опытом реализации проектов различной сложности":
        "Certified project managers (IPMA) work in the OU, possessing practical experience in implementing projects of varying complexity.",
      "Количество реализованных проектов при участии ОУП":
        "Number of projects implemented with the participation of OU",
      проектов: "projects",
      "2023 г. -": "2023 -",
      "2024 г. -": "2024 -",
      "Услуги и компетенции": "Services and Competencies",
      "Разработка и внедрение единых стандартов управления проектами":
        "Development and implementation of unified project management standards",
      "Регистрация авторских прав на собственные разработки КБТУ":
        "Registration of copyright for KBTU's own developments",
      "Обучение проектным подходам при управлении проектами":
        "Training in project approaches to project management",
      "Реализация внешних проектов под ключ":
        "Implementation of turnkey external projects",
      "Управление внутренними проектами и поддержка команд в организации процессов и документации":
        "Management of internal projects and support for teams in organizing processes and documentation",
      "Консалтинг и аудит проектов": "Consulting and project auditing",
      "Подходы к работе": "Approaches to Work",
      "Классические методологии": "Classic Methodologies",
      "Гибкие подходы": "Agile Approaches",
      PMBOK: "PMBOK",
      PRINCE2: "PRINCE2",
      Scrum: "Scrum",
      Kanban: "Kanban",
      "Наши проекты": "Our Projects",
      "Аналитическая цифровая платформа «Умная ферма»":
        "Analytical Digital Platform 'Smart Farm'",
      "Управление производственными процессами - создание технологических карт, разработка производственных планов, подготовка полей, контроль посевов, полива, защиты растений, мониторинг процессов уборки, хранения урожая.":
        "Management of production processes - creation of technological maps, development of production plans, field preparation, crop control, irrigation, plant protection, monitoring of harvesting and storage processes.",
      "Получено авторское сведетельство и патент на полезную модель по проекту.":
        "Copyright certificate and patent for a utility model have been obtained for the project.",
      "Система ориентации (навигации) в здании КБТУ":
        "Navigation System in the KBTU Building",
      "Помогает проложить оптимальный маршрут и найти необходимые локации.":
        "Helps to plot the optimal route and find necessary locations.",
      "Приложение для автоматического открытия шлагбаума":
        "Application for Automatic Barrier Opening",
      "Пользователь может открыть шлагбаум с телефона. ПО для Службы безопасности - позволяет контролировать время заезда, количество заездов и персонифицировать пользователей.":
        "The user can open the barrier from their phone. Software for the Security Service allows controlling entry time, number of entries, and user personalization.",
      "Проект NFT дипломы": "NFT Diploma Project",
      "Портал с цифровым NFT дипломом. Реализация смарт-контракта на основе технологий blockchain исключает риск подделки диплома на 100%. Онлайн сервис для проверки диплома выпускника в открытой библиотеке NFT дипломов.":
        "Portal with a digital NFT diploma. Implementation of a smart contract based on blockchain technology eliminates the risk of diploma forgery by 100%. Online service for verifying graduate diplomas in an open NFT diploma library.",
      "Разработка “Цифровой платформы прослеживания семян”":
        "Development of the 'Digital Seed Tracking Platform'",
      "Разработана MVP версия платформы. Опубликована по ссылке":
        "An MVP version of the platform has been developed. Published at the link",
      "Проведена демонстрация в КИЗ, руководителям ПО и ЗИР, а также акиму г. Алматы. Проводятся работы по развитию системы совместно с КазНАИУ , ПО и ЗИР.":
        "A demonstration was conducted at KIZ, to the heads of PO and ZIR, as well as the mayor of Almaty. Work is underway to develop the system jointly with KazNAIU, PO, and ZIR.",
      "Получено авторское сведетельство по проекту.":
        "Copyright certificate for the project has been obtained.",
      "Банк технологии КБТУ": "KBTU Technology Bank",
      "Силами студентов КБТУ разработана MVP версия проекта.":
        "An MVP version of the project was developed by KBTU students.",
      "Сайт опубликован по ссылке": "The website is published at the link",
      "Участие в проекте по развитию “Аналитической базы данных” совместно с компанией AppStream":
        "Participation in the project to develop the 'Analytical Database' jointly with AppStream",
      "Разработан инструмент для анализа социально-экономических показателей нефтегазовой отрасли, построения социально-экономических моделей, медиа мониторинга, для обеспечения стратегического планирования на основе анализа трендов и потребностей отрасли.":
        "A tool has been developed for analyzing socio-economic indicators of the oil and gas industry, building socio-economic models, media monitoring, and ensuring strategic planning based on trend and industry needs analysis.",
      "Аналитическая Система Диспетчерского центра АО НК «КазМунайГаз»":
        "Analytical System of the Dispatch Center of JSC NC 'KazMunayGas'",
      "Разработана централизованная информационная и аналитическая поддержка управления процессами производства и реализации нефтепродуктов.":
        "Centralized information and analytical support for managing production and sales processes of petroleum products has been developed.",
      "Проекте DPG": "DPG Project",
      "Выполнен совместно с GameLab KBTU по заказу детского фонда ООН ЮНИСЕФ. Цель: увеличение количества проектов, способствующих устойчивому развитию через создание цифровых общественных благ. Курс был подготовлен для школьников и студентов опубликован на платформе learningpassport:":
        "Implemented jointly with GameLab KBTU at the request of the UNICEF Children's Fund. Goal: to increase the number of projects contributing to sustainable development through the creation of digital public goods. The course was prepared for schoolchildren and students and published on the learningpassport platform:",
      "Информация по курсу": "Course information",
      "Для данного курса была разработана игра":
        "A game was developed for this course",
      "Unisat Game": "Unisat Game",
      "По заказу детского фонда ООН Юнисеф и КазНУ им.Аль-Фараби GameLab KBTU разработал игру для геймификации процесса сборки наноспутника.":
        "At the request of the UNICEF Children's Fund and Al-Farabi KazNU, GameLab KBTU developed a game for gamifying the nanosatellite assembly process.",
      "Игра создана и опубликована на портале:":
        "The game was created and published on the portal:",
      "Онлайн курс и хакатон по геймификации в партнёрстве ЮНИСЕФ":
        "Online Course and Hackathon on Gamification in Partnership with UNICEF",
      "В 2023 г. GameLab KBTU совместно с Детским Фондом ООН (ЮНИСЕФ) в Казахстане запустили программу по поддержке девушек в STEAM (science, technology, engineering, arts, math).":
        "In 2023, GameLab KBTU, together with the UNICEF Children's Fund in Kazakhstan, launched a program to support girls in STEAM (science, technology, engineering, arts, math).",
      "Создан открытый онлайн курс «Level Up: введение в видеоигры и геймификацию» на русском и казахском языках на платформе Learning Passport.":
        "An open online course 'Level Up: Introduction to Video Games and Gamification' was created in Russian and Kazakh on the Learning Passport platform.",
      "На курс зарегистрировалось 700+ участников.":
        "700+ participants registered for the course.",
      "Проведен первый хакатон по геймификации для 50 лучших выпускниц курса":
        "The first gamification hackathon was held for the top 50 graduates of the course.",
      "Модернизация системы СКУД с внедрением биометрии (распознавания лиц)":
        "Modernization of the ACS system with the introduction of biometrics (face recognition)",
      "Совместно с СБ модернизирована система СКУД, внедрена биометрия (распознавание лиц). Усовершенствована пропускная система.":
        "The ACS system was modernized jointly with the SB, biometrics (face recognition) were introduced. The access system was improved.",
      "Психологический тест Разуваевой": "Razuvaeva Psychological Test",
      "Подготовлен опросник для студентов. Результаты находятся у психолога КБТУ, данный опросник психолог использует для определения психологического состояния студентов, при необходимости записывает студентов на онлайн/оффлайн консультации для проведения с ним работ.":
        "A questionnaire for students has been prepared. The results are with the KBTU psychologist, who uses this questionnaire to determine the psychological state of students and, if necessary, schedules online/offline consultations with them.",
      "Ознакомится с тестом-опросником можно по ссылке:":
        "You can familiarize yourself with the questionnaire at the link:",
      "Инкубационная программа для QazInnovation":
        "Incubation Program for QazInnovation",
      "Реализована инкубационная программа и выявлены потенциальных стартап-идеи с дальнейшей передачей их заказчику. Проведены мероприятия для стартапов:":
        "An incubation program was implemented, and potential startup ideas were identified for further transfer to the customer. Events for startups were held:",
      воркшопы: "workshops",
      трекинги: "tracking",
      "консультациис тартап команд": "consultations with startup teams",
      "обучающий мастер-класс по организации и проведению инкубационных программ":
        "training master class on organizing and conducting incubation programs",
      "Demo day": "Demo day",
      "Создание практического класса нефтяного полигона в СЭЗ «ПИТ»":
        "Creation of a Practical Oilfield Class in SEZ 'PIT'",
      "В 2024 г. запущено учебное месторождение АО «Каспий нефть» в СЭЗ «ПИТ». Пробурено 5 скважин, оснащенных оборудованием, применяемым на реальных месторождениях. Имеется подземный резервуар объемом 5 кубометров, имитирующий месторождение. Все скважины оцифрованы, информация передается в диспетчерскую, расположенную в КБТУ. Тренировочным полем также можно управлять из диспетчерской.":
        "In 2024, a training oilfield of JSC 'Caspian Oil' was launched in SEZ 'PIT'. Five wells were drilled, equipped with equipment used in real oilfields. There is an underground reservoir with a volume of 5 cubic meters, simulating an oilfield. All wells are digitized, and information is transmitted to the control room located at KBTU. The training field can also be controlled from the control room.",
      "ОУП участвовал с другими подразделениями КБТУ в организации и проведении конференций:":
        "OUP participated with other KBTU divisions in organizing and holding conferences:",
      "ХI Международная научно-практическая конференция «Развитие урановой и редкометальной промышленности»":
        "XI International Scientific and Practical Conference 'Development of the Uranium and Rare Metal Industry'",
      "Х Юбилейная Международная научно-практическая конференция «Актуальные проблемы урановой промышленности»":
        "X Anniversary International Scientific and Practical Conference 'Current Issues of the Uranium Industry'",
      "Форум по цифровизации Digital Almaty":
        "Digital Almaty Digitalization Forum",
      "10-летие Морской академии": "10th Anniversary of the Maritime Academy",
      "Подготовка требований для сайта kbtu.edu.kz":
        "Preparation of Requirements for the kbtu.edu.kz Website",
      "Проведены исследования потребностей пользователей":
        "User needs research conducted",
      "Сформулированы требования к продукту": "Product requirements formulated",
      "Создана структура продукта в графическом редакторе.":
        "Product structure created in a graphic editor.",
      "Выбор способа технической реализации продукта":
        "Choice of technical implementation method for the product",
      "Создан прототип продукта в графическом редакторе Figma:":
        "Product prototype created in the Figma graphic editor:",
      "Проведен анализ референсов и UX исследования по ссылке:":
        "Reference analysis and UX research conducted at the link:",
    },
  },
  ru: {
    translation: {
      "О нас": "О нас",
      Контакты: "Контакты",
      Проекты: "Проекты",
      "Управляем проектами — создаем": "Управляем проектами — создаем",
      успех: "успех",
      "Связаться с нами": "Связаться с нами",
      "Мы, команда профессионалов, реализуем внутренние и внешние проекты с максимальной эффективностью, используя современные подходы проектного управления":
        "Мы, команда профессионалов, реализуем внутренние и внешние проекты с максимальной эффективностью, используя современные подходы проектного управления",
      "Проектный офис КБТУ": "Проектный офис КБТУ",
      "основанный в 2022 году, был создан как внутреннее подразделение университета с целью внедрения и продвижения современных практик и подходов проектного управления в его деятельности.":
        "основанный в 2022 году, был создан как внутреннее подразделение университета с целью внедрения и продвижения современных практик и подходов проектного управления в его деятельности.",
      "Наша миссия": "Наша миссия",
      "Создавать и развивать проектную культуру в университете, внедряя передовые методы управления, способствующие устойчивому развитию и укреплению позиций вуза в образовательной и научной сферах.":
        "Создавать и развивать проектную культуру в университете, внедряя передовые методы управления, способствующие устойчивому развитию и укреплению позиций вуза в образовательной и научной сферах.",
      "Выступать центром компетенций в области проектного управления, поддерживая и развивая внутренние и внешние инициативы университета.":
        "Выступать центром компетенций в области проектного управления, поддерживая и развивая внутренние и внешние инициативы университета.",
      "Наши цели": "Наши цели",
      "Унификация процессов и повышение прозрачности":
        "Унификация процессов и повышение прозрачности",
      "Внедрение единого стандарта управления проектами для обеспечения эффективности реализации, прозрачности всех этапов проектной деятельности и снижения рисков, связанных с реализацией проектов.":
        "Внедрение единого стандарта управления проектами для обеспечения эффективности реализации, прозрачности всех этапов проектной деятельности и снижения рисков, связанных с реализацией проектов.",
      "Развитие культуры проектного управления":
        "Развитие культуры проектного управления",
      "Формирование и укрепление культуры управления проектами в университете, способствующей повышению профессионального уровня сотрудников и улучшению результатов работы.":
        "Формирование и укрепление культуры управления проектами в университете, способствующей повышению профессионального уровня сотрудников и улучшению результатов работы.",
      "Внедрение передовых практик": "Внедрение передовых практик",
      "Анализ современных подходов и лучших мировых практик в области управления проектами, их адаптация и интеграция в процессы проектной деятельности КБТУ для достижения новых высот в управлении проектами.":
        "Анализ современных подходов и лучших мировых практик в области управления проектами, их адаптация и интеграция в процессы проектной деятельности КБТУ для достижения новых высот в управлении проектами.",
      "Факты и цифры": "Факты и цифры",
      "В ОУП работают сертифицированные проектные менеджеры (IPMA), обладающие практическим опытом реализации проектов различной сложности":
        "В ОУП работают сертифицированные проектные менеджеры (IPMA), обладающие практическим опытом реализации проектов различной сложности",
      "Количество реализованных проектов при участии ОУП":
        "Количество реализованных проектов при участии ОУП",
      проектов: "проектов",
      "2023 г. -": "2023 г. -",
      "2024 г. -": "2024 г. -",
      "Услуги и компетенции": "Услуги и компетенции",
      "Разработка и внедрение единых стандартов управления проектами":
        "Разработка и внедрение единых стандартов управления проектами",
      "Регистрация авторских прав на собственные разработки КБТУ":
        "Регистрация авторских прав на собственные разработки КБТУ",
      "Обучение проектным подходам при управлении проектами":
        "Обучение проектным подходам при управлении проектами",
      "Реализация внешних проектов под ключ":
        "Реализация внешних проектов под ключ",
      "Управление внутренними проектами и поддержка команд в организации процессов и документации":
        "Управление внутренними проектами и поддержка команд в организации процессов и документации",
      "Консалтинг и аудит проектов": "Консалтинг и аудит проектов",
      "Подходы к работе": "Подходы к работе",
      "Классические методологии": "Классические методологии",
      "Гибкие подходы": "Гибкие подходы",
      PMBOK: "PMBOK",
      PRINCE2: "PRINCE2",
      Scrum: "Scrum",
      Kanban: "Kanban",
      "Наши проекты": "Наши проекты",
      "Аналитическая цифровая платформа «Умная ферма»":
        "Аналитическая цифровая платформа «Умная ферма»",
      "Система ориентации (навигации) в здании КБТУ":
        "Система ориентации (навигации) в здании КБТУ",
      "Разработка “Цифровой платформы прослеживания семян”":
        "Разработка “Цифровой платформы прослеживания семян”",
      "Онлайн курс и хакатон по геймификации в партнёрстве ЮНИСЕФ":
        "Онлайн курс и хакатон по геймификации в партнёрстве ЮНИСЕФ",
      Подробнее: "Подробнее",
      "Инструменты и технологии": "Инструменты и технологии",
      Инструмент: "Инструмент",
      Описание: "Описание",
      Преимущества: "Преимущества",
      "Система управления задачами, популярная среди разработчиков":
        "Система управления задачами, популярная среди разработчиков",
      "Гибкость, мощные возможности для Agile и Scrum":
        "Гибкость, мощные возможности для Agile и Scrum",
      "Доска для управления задачами с карточками":
        "Доска для управления задачами с карточками",
      "Простота, удобство для небольших команд":
        "Простота, удобство для небольших команд",
      "Программа для планирования проектов":
        "Программа для планирования проектов",
      "Подходит для крупных компаний, аналитика и отчеты":
        "Подходит для крупных компаний, аналитика и отчеты",
      "Органайзер задач с расширенными возможностями":
        "Органайзер задач с расширенными возможностями",
      "Интуитивный интерфейс, интеграции с другими сервисами":
        "Интуитивный интерфейс, интеграции с другими сервисами",
      "Как мы работаем": "Как мы работаем",
      "Контактная информация": "Контактная информация",
      "улица Толе Би 59, Алматы 050000": "улица Толе Би 59, Алматы 050000",
      "8 727 357 42 51": "8 727 357 42 51",
      "info@kbtu.kz": "info@kbtu.kz",
      Имя: "Имя",
      Email: "Email",
      Комментарий: "Комментарий",
      Телефон: "Телефон",
      Отправить: "Отправить",
      Главная: "Главная",
      "2025 | Казахстанско-Британский Технический Университет | All rights reserved ®":
        "2025 | Казахстанско-Британский Технический Университет | Все права защищены ®",
      "Написать в Telegram": "Написать в Telegram",
    },
  },
  kz: {
    translation: {
      "О нас": "Біз туралы",
      Контакты: "Байланыс",
      Проекты: "Жобалар",
      "Управляем проектами — создаем": "Біз жобаларды басқарамыз — жасаймыз",
      успех: "табыс",
      "Связаться с нами": "Бізбен байланыс",
      "Мы, команда профессионалов, реализуем внутренние и внешние проекты с максимальной эффективностью, используя современные подходы проектного управления":
        "Біз, кәсіби команда, ішкі және сыртқы жобаларды максималды тиімділікпен жүзеге асырамыз, заманауи жобаларды басқару тәсілдерін пайдалана отырып",
      "Проектный офис КБТУ": "КБТУ жобалық офисі",
      "основанный в 2022 году, был создан как внутреннее подразделение университета с целью внедрения и продвижения современных практик и подходов проектного управления в его деятельности.":
        "2022 жылы құрылған, университеттің ішкі бөлімшесі ретінде заманауи жобаларды басқару практикаларын енгізу және ілгерілету мақсатында құрылды.",
      "Наша миссия": "Біздің миссиямыз",
      "Создавать и развивать проектную культуру в университете, внедряя передовые методы управления, способствующие устойчивому развитию и укреплению позиций вуза в образовательной и научной сферах.":
        "Университетте жобалық мәдениетті қалыптастыру және дамыту, тұрақты дамуға ықпал ететін заманауи басқару әдістерін енгізу.",
      "Выступать центром компетенций в области проектного управления, поддерживая и развивая внутренние и внешние инициативы университета.":
        "Жобаларды басқару саласындағы құзыреттілік орталығы ретінде қызмет ету, университеттің ішкі және сыртқы бастамаларын қолдау және дамыту.",
      "Наши цели": "Біздің мақсаттарымыз",
      "Унификация процессов и повышение прозрачности":
        "Процестерді унификациялау және ашықтықты арттыру",
      "Внедрение единого стандарта управления проектами для обеспечения эффективности реализации, прозрачности всех этапов проектной деятельности и снижения рисков, связанных с реализацией проектов.":
        "Жобаларды басқарудың біртұтас стандартын енгізу, жобалық қызметтің барлық кезеңдерінің тиімділігін, ашықтығын қамтамасыз ету және жобаларды жүзеге асырумен байланысты тәуекелдерді азайту.",
      "Развитие культуры проектного управления":
        "Жобаларды басқару мәдениетін дамыту",
      "Формирование и укрепление культуры управления проектами в университете, способствующей повышению профессионального уровня сотрудников и улучшению результатов работы.":
        "Университетте жобаларды басқару мәдениетін қалыптастыру және нығайту, қызметкерлердің кәсіби деңгейін арттыруға және жұмыс нәтижелерін жақсартуға ықпал ету.",
      "Внедрение передовых практик": "Алдыңғы қатарлы практикаларды енгізу",
      "Анализ современных подходов и лучших мировых практик в области управления проектами, их адаптация и интеграция в процессы проектной деятельности КБТУ для достижения новых высот в управлении проектами.":
        "Жобаларды басқару саласындағы заманауи тәсілдер мен әлемдік үздік практикаларды талдау, оларды КБТУ-ның жобалық қызметіне бейімдеу және интеграциялау.",
      "Факты и цифры": "Фактілер мен сандар",
      "В ОУП работают сертифицированные проектные менеджеры (IPMA), обладающие практическим опытом реализации проектов различной сложности":
        "ОУП-те сертификатталған жобалық менеджерлер (IPMA) жұмыс істейді, әртүрлі күрделіліктегі жобаларды жүзеге асыруда практикалық тәжірибесі бар.",
      "Количество реализованных проектов при участии ОУП":
        "ОУП-тің қатысуымен жүзеге асырылған жобалардың саны",
      проектов: "жобалар",
      "2023 г. -": "2023 ж. -",
      "2024 г. -": "2024 ж. -",
      "Услуги и компетенции": "Қызметтер мен құзыреттер",
      "Разработка и внедрение единых стандартов управления проектами":
        "Жобаларды басқарудың біртұтас стандарттарын әзірлеу және енгізу",
      "Регистрация авторских прав на собственные разработки КБТУ":
        "КБТУ-ның өз әзірлемелеріне авторлық құқықтарды тіркеу",
      "Обучение проектным подходам при управлении проектами":
        "Жобаларды басқаруда жобалық тәсілдер бойынша оқыту",
      "Реализация внешних проектов под ключ":
        "Кілтпен сыртқы жобаларды жүзеге асыру",
      "Управление внутренними проектами и поддержка команд в организации процессов и документации":
        "Ішкі жобаларды басқару және командаларды процестер мен құжаттаманы ұйымдастыруда қолдау",
      "Консалтинг и аудит проектов": "Жобаларды консалтинг және аудит",
      "Подходы к работе": "Жұмыс тәсілдері",
      "Классические методологии": "Классикалық әдістемелер",
      "Гибкие подходы": "Икемді тәсілдер",
      PMBOK: "PMBOK",
      PRINCE2: "PRINCE2",
      Scrum: "Scrum",
      Kanban: "Kanban",
      "Наши проекты": "Біздің жобалар",
      "Аналитическая цифровая платформа «Умная ферма»":
        "Аналитикалық цифрлық платформа 'Ақылды ферма'",
      "Система ориентации (навигации) в здании КБТУ":
        "КБТУ ғимаратындағы бағдарлау (навигация) жүйесі",
      "Разработка “Цифровой платформы прослеживания семян”":
        "“Цифрлық тұқымдарды бақылау платформасын” әзірлеу",
      "Онлайн курс и хакатон по геймификации в партнёрстве ЮНИСЕФ":
        "ЮНИСЕФ-пен серіктестік бойынша геймификация тақырыбында онлайн курс және хакатон",
      "Аналитическая цифровая платформа «Умная ферма»":
        "Аналитикалық цифрлық платформа 'Ақылды ферма'",
      "Управление производственными процессами - создание технологических карт, разработка производственных планов, подготовка полей, контроль посевов, полива, защиты растений, мониторинг процессов уборки, хранения урожая.":
        "Өндірістік процестерді басқару - технологиялық карталарды жасау, өндірістік жоспарларды әзірлеу, алқаптарды дайындау, егістіктерді бақылау, суару, өсімдіктерді қорғау, жинау және сақтау процестерін бақылау.",
      "Получено авторское сведетельство и патент на полезную модель по проекту.":
        "Жоба бойынша авторлық куәлік пен пайдалы модельге патент алынды.",
      "Система ориентации (навигации) в здании КБТУ":
        "КБТУ ғимаратындағы навигация жүйесі",
      "Помогает проложить оптимальный маршрут и найти необходимые локации.":
        "Оптималды маршрутты салуға және қажетті орындарды табуға көмектеседі.",
      "Приложение для автоматического открытия шлагбаума":
        "Шлагбаумды автоматты түрде ашу қосымшасы",
      "Пользователь может открыть шлагбаум с телефона. ПО для Службы безопасности - позволяет контролировать время заезда, количество заездов и персонифицировать пользователей.":
        "Пайдаланушы шлагбаумды телефон арқылы аша алады. Қауіпсіздік қызметіне арналған бағдарламалық қамтамасыз ету - кіру уақытын, кіру санын бақылауға және пайдаланушыларды дараландыруға мүмкіндік береді.",
      "Проект NFT дипломы": "NFT диплом жобасы",
      "Портал с цифровым NFT дипломом. Реализация смарт-контракта на основе технологий blockchain исключает риск подделки диплома на 100%. Онлайн сервис для проверки диплома выпускника в открытой библиотеке NFT дипломов.":
        "Цифрлық NFT дипломы бар портал. Blockchain технологиялары негізінде смарт-келісімшартты іске асыру дипломды қолдан жасау қаупін 100% жояды. NFT дипломдарының ашық кітапханасында түлектің дипломын тексеруге арналған онлайн қызмет.",
      "Разработка “Цифровой платформы прослеживания семян”":
        "“Тұқымдарды бақылаудың цифрлық платформасын” әзірлеу",
      "Разработана MVP версия платформы. Опубликована по ссылке":
        "Платформаның MVP нұсқасы әзірленді. Сілтеме бойынша жарияланды",
      "Проведена демонстрация в КИЗ, руководителям ПО и ЗИР, а также акиму г. Алматы. Проводятся работы по развитию системы совместно с КазНАИУ , ПО и ЗИР.":
        "КИЗ-де, ПО және ЗИР басшыларына, сондай-ақ Алматы қаласының әкіміне демонстрация өткізілді. Жүйені дамыту бойынша жұмыстар КазНАИУ, ПО және ЗИР-мен бірлесіп жүргізілуде.",
      "Получено авторское сведетельство по проекту.":
        "Жоба бойынша авторлық куәлік алынды.",
      "Банк технологии КБТУ": "КБТУ технологиялар банкі",
      "Силами студентов КБТУ разработана MVP версия проекта.":
        "КБТУ студенттерінің күшімен жобаның MVP нұсқасы әзірленді.",
      "Сайт опубликован по ссылке": "Сайт сілтеме бойынша жарияланды",
      "Участие в проекте по развитию “Аналитической базы данных” совместно с компанией AppStream":
        "AppStream компаниясымен бірлесіп “Аналитикалық деректер базасын” дамыту жобасына қатысу",
      "Разработан инструмент для анализа социально-экономических показателей нефтегазовой отрасли, построения социально-экономических моделей, медиа мониторинга, для обеспечения стратегического планирования на основе анализа трендов и потребностей отрасли.":
        "Мұнай-газ саласының әлеуметтік-экономикалық көрсеткіштерін талдау, әлеуметтік-экономикалық модельдерді құру, медиа мониторинг жүргізу үшін құрал әзірленді.",
      "Аналитическая Система Диспетчерского центра АО НК «КазМунайГаз»":
        "ҚазМұнайГаз АҚ диспетчерлік орталығының аналитикалық жүйесі",
      "Разработана централизованная информационная и аналитическая поддержка управления процессами производства и реализации нефтепродуктов.":
        "Мұнай өнімдерін өндіру және өткізу процестерін басқаруға арналған орталықтандырылған ақпараттық және аналитикалық қолдау әзірленді.",
      "Проекте DPG": "DPG жобасы",
      "Выполнен совместно с GameLab KBTU по заказу детского фонда ООН ЮНИСЕФ. Цель: увеличение количества проектов, способствующих устойчивому развитию через создание цифровых общественных благ. Курс был подготовлен для школьников и студентов опубликован на платформе learningpassport:":
        "ЮНИСЕФ-тің тапсырысы бойынша GameLab KBTU-мен бірлесіп жүзеге асырылды. Мақсаты: цифрлық қоғамдық игіліктерді құру арқылы тұрақты дамуға ықпал ететін жобалар санын арттыру.",
      "Информация по курсу": "Курс туралы ақпарат",
      "Для данного курса была разработана игра": "Бұл курс үшін ойын әзірленді",
      "Unisat Game": "Unisat ойыны",
      "По заказу детского фонда ООН Юнисеф и КазНУ им.Аль-Фараби GameLab KBTU разработал игру для геймификации процесса сборки наноспутника.":
        "ЮНИСЕФ және әл-Фараби атындағы ҚазҰУ тапсырысы бойынша GameLab KBTU наноспутник құрастыру процесін геймификациялау үшін ойын әзірледі.",
      "Игра создана и опубликована на портале:":
        "Ойын жасалып, порталға жарияланды:",
      "Онлайн курс и хакатон по геймификации в партнёрстве ЮНИСЕФ":
        "ЮНИСЕФ-пен серіктестікте геймификация бойынша онлайн курс және хакатон",
      "В 2023 г. GameLab KBTU совместно с Детским Фондом ООН (ЮНИСЕФ) в Казахстане запустили программу по поддержке девушек в STEAM (science, technology, engineering, arts, math).":
        "2023 жылы GameLab KBTU ЮНИСЕФ-пен бірлесіп STEAM саласындағы қыздарды қолдау бағдарламасын іске қосты.",
      "Создан открытый онлайн курс «Level Up: введение в видеоигры и геймификацию» на русском и казахском языках на платформе Learning Passport.":
        "Learning Passport платформасында орыс және қазақ тілдерінде «Level Up: бейне ойындар мен геймификацияға кіріспе» ашық онлайн курсы құрылды.",
      "На курс зарегистрировалось 700+ участников.":
        "Курсқа 700+ қатысушы тіркелді.",
      "Проведен первый хакатон по геймификации для 50 лучших выпускниц курса":
        "Курстың үздік 50 түлегі үшін алғашқы геймификация хакатоны өткізілді.",
      "Модернизация системы СКУД с внедрением биометрии (распознавания лиц)":
        "СКУД жүйесін биометрияны (бет-әлпетті тану) енгізу арқылы жаңғырту",
      "Совместно с СБ модернизирована система СКУД, внедрена биометрия (распознавание лиц). Усовершенствована пропускная система.":
        "Қауіпсіздік қызметімен бірлесіп СКУД жүйесі жаңғыртылды, биометрия (бет-әлпетті тану) енгізілді. Өту жүйесі жетілдірілді.",
    },
  },
};

i18n.use(initReactI18next).init({
  resources,
  lng: "ru",
  fallbackLng: "ru",
  interpolation: {
    escapeValue: false,
  },
});

export default i18n;
