import i18n from "i18next";
import { initReactI18next } from "react-i18next";

i18n.use(initReactI18next).init({
  resources: {
    ru: {
      translation: {
        "О нас": "О нас",
        Контакты: "Контакты",
        Проекты: "Проекты",
        "Управляем проектами — создаем": "Управляем проектами — создаем",
        успех: "успех",
        "Связаться с нами": "Связаться с нами",
        "Мы, команда профессионалов, реализуем внутренние и внешние проекты с максимальной эффективностью, используя современные подходы проектного управления":
          "Мы, команда профессионалов, реализуем внутренние и внешние проекты с максимальной эффективностью, используя современные подходы проектного управления",
        "Проектный офис КБТУ": "Проектный офис КБТУ",
        "основанный в 2022 году, был создан как внутреннее подразделение университета с целью внедрения и продвижения современных практик и подходов проектного управления в его деятельности.":
          "основанный в 2022 году, был создан как внутреннее подразделение университета с целью внедрения и продвижения современных практик и подходов проектного управления в его деятельности.",
        "Наша миссия": "Наша миссия",
        "Создавать и развивать проектную культуру в университете, внедряя передовые методы управления, способствующие устойчивому развитию и укреплению позиций вуза в образовательной и научной сферах.":
          "Создавать и развивать проектную культуру в университете, внедряя передовые методы управления, способствующие устойчивому развитию и укреплению позиций вуза в образовательной и научной сферах.",
        "Выступать центром компетенций в области проектного управления, поддерживая и развивая внутренние и внешние инициативы университета.":
          "Выступать центром компетенций в области проектного управления, поддерживая и развивая внутренние и внешние инициативы университета.",
        "Наши цели": "Наши цели",
        "Унификация процессов и повышение прозрачности":
          "Унификация процессов и повышение прозрачности",
        "Внедрение единого стандарта управления проектами для обеспечения эффективности реализации, прозрачности всех этапов проектной деятельности и снижения рисков, связанных с реализацией проектов.":
          "Внедрение единого стандарта управления проектами для обеспечения эффективности реализации, прозрачности всех этапов проектной деятельности и снижения рисков, связанных с реализацией проектов.",
        "Развитие культуры проектного управления":
          "Развитие культуры проектного управления",
        "Формирование и укрепление культуры управления проектами в университете, способствующей повышению профессионального уровня сотрудников и улучшению результатов работы.":
          "Формирование и укрепление культуры управления проектами в университете, способствующей повышению профессионального уровня сотрудников и улучшению результатов работы.",
        "Внедрение передовых практик": "Внедрение передовых практик",
        "Анализ современных подходов и лучших мировых практик в области управления проектами, их адаптация и интеграция в процессы проектной деятельности КБТУ для достижения новых высот в управлении проектами.":
          "Анализ современных подходов и лучших мировых практик в области управления проектами, их адаптация и интеграция в процессы проектной деятельности КБТУ для достижения новых высот в управлении проектами.",
        "Факты и цифры": "Факты и цифры",
        "В ОУП работают сертифицированные проектные менеджеры (IPMA), обладающие практическим опытом реализации проектов различной сложности":
          "В ОУП работают сертифицированные проектные менеджеры (IPMA), обладающие практическим опытом реализации проектов различной сложности",
        "Количество реализованных проектов при участии ОУП":
          "Количество реализованных проектов при участии ОУП",
        проектов: "проектов",
        "2023 г. -": "2023 г. -",
        "2024 г. -": "2024 г. -",
        "Услуги и компетенции": "Услуги и компетенции",
        "Разработка и внедрение единых стандартов управления проектами":
          "Разработка и внедрение единых стандартов управления проектами",
        "Регистрация авторских прав на собственные разработки КБТУ":
          "Регистрация авторских прав на собственные разработки КБТУ",
        "Обучение проектным подходам при управлении проектами":
          "Обучение проектным подходам при управлении проектами",
        "Реализация внешних проектов под ключ":
          "Реализация внешних проектов под ключ",
        "Управление внутренними проектами и поддержка команд в организации процессов и документации":
          "Управление внутренними проектами и поддержка команд в организации процессов и документации",
        "Консалтинг и аудит проектов": "Консалтинг и аудит проектов",
        "Подходы к работе": "Подходы к работе",
        "Классические методологии": "Классические методологии",
        "Гибкие подходы": "Гибкие подходы",
        PMBOK: "PMBOK",
        PRINCE2: "PRINCE2",
        Scrum: "Scrum",
        Kanban: "Kanban",
        "Наши проекты": "Наши проекты",
        "Аналитическая цифровая платформа «Умная ферма»":
          "Аналитическая цифровая платформа «Умная ферма»",
        "Система ориентации (навигации) в здании КБТУ":
          "Система ориентации (навигации) в здании КБТУ",
        "Разработка “Цифровой платформы прослеживания семян”":
          "Разработка “Цифровой платформы прослеживания семян”",
        "Онлайн курс и хакатон по геймификации в партнёрстве ЮНИСЕФ":
          "Онлайн курс и хакатон по геймификации в партнёрстве ЮНИСЕФ",
        Подробнее: "Подробнее",
        "Инструменты и технологии": "Инструменты и технологии",
        Инструмент: "Инструмент",
        Описание: "Описание",
        Преимущества: "Преимущества",
        "Система управления задачами, популярная среди разработчиков":
          "Система управления задачами, популярная среди разработчиков",
        "Гибкость, мощные возможности для Agile и Scrum":
          "Гибкость, мощные возможности для Agile и Scrum",
        "Доска для управления задачами с карточками":
          "Доска для управления задачами с карточками",
        "Простота, удобство для небольших команд":
          "Простота, удобство для небольших команд",
        "Программа для планирования проектов":
          "Программа для планирования проектов",
        "Подходит для крупных компаний, аналитика и отчеты":
          "Подходит для крупных компаний, аналитика и отчеты",
        "Органайзер задач с расширенными возможностями":
          "Органайзер задач с расширенными возможностями",
        "Интуитивный интерфейс, интеграции с другими сервисами":
          "Интуитивный интерфейс, интеграции с другими сервисами",
        "Как мы работаем": "Как мы работаем",
        "Контактная информация": "Контактная информация",
        "улица Толе Би 59, Алматы 050000": "улица Толе Би 59, Алматы 050000",
        "8 727 357 42 51": "8 727 357 42 51",
        "info@kbtu.kz": "info@kbtu.kz",
        Имя: "Имя",
        Email: "Email",
        Комментарий: "Комментарий",
        Телефон: "Телефон",
        Отправить: "Отправить",
        Главная: "Главная",
        "2025 | Казахстанско-Британский Технический Университет | All rights reserved ®":
          "2025 | Казахстанско-Британский Технический Университет | Все права защищены ®",
        "Написать в Telegram": "Написать в Telegram",
      },
    },
    en: {
      translation: {
        "О нас": "About Us",
        Контакты: "Contacts",
        Проекты: "Projects",
        "Управляем проектами — создаем": "We manage projects — we create",
        успех: "success",
        "Связаться с нами": "Contact Us",
        "Мы, команда профессионалов, реализуем внутренние и внешние проекты с максимальной эффективностью, используя современные подходы проектного управления":
          "We, a team of professionals, implement internal and external projects with maximum efficiency, using modern project management approaches",
        "Проектный офис КБТУ": "Project Office KBTU",
        "основанный в 2022 году, был создан как внутреннее подразделение университета с целью внедрения и продвижения современных практик и подходов проектного управления в его деятельности.":
          "founded in 2022, was created as an internal division of the university with the aim of implementing and promoting modern practices and approaches to project management in its activities.",
        "Наша миссия": "Our Mission",
        "Создавать и развивать проектную культуру в университете, внедряя передовые методы управления, способствующие устойчивому развитию и укреплению позиций вуза в образовательной и научной сферах.":
          "To create and develop a project culture at the university by implementing advanced management methods that contribute to sustainable development and strengthen the university's position in educational and scientific fields.",
        "Выступать центром компетенций в области проектного управления, поддерживая и развивая внутренние и внешние инициативы университета.":
          "To act as a center of competence in project management, supporting and developing internal and external initiatives of the university.",
        "Наши цели": "Our Goals",
        "Унификация процессов и повышение прозрачности":
          "Unification of processes and increasing transparency",
        "Внедрение единого стандарта управления проектами для обеспечения эффективности реализации, прозрачности всех этапов проектной деятельности и снижения рисков, связанных с реализацией проектов.":
          "Implementation of a unified project management standard to ensure the effectiveness of implementation, transparency of all stages of project activities, and reduction of risks associated with project implementation.",
        "Развитие культуры проектного управления":
          "Development of project management culture",
        "Формирование и укрепление культуры управления проектами в университете, способствующей повышению профессионального уровня сотрудников и улучшению результатов работы.":
          "Formation and strengthening of project management culture at the university, contributing to the improvement of professional level of employees and better work results.",
        "Внедрение передовых практик": "Implementation of best practices",
        "Анализ современных подходов и лучших мировых практик в области управления проектами, их адаптация и интеграция в процессы проектной деятельности КБТУ для достижения новых высот в управлении проектами.":
          "Analysis of modern approaches and best world practices in project management, their adaptation and integration into the project activities of KBTU to achieve new heights in project management.",
        "Факты и цифры": "Facts and Figures",
        "В ОУП работают сертифицированные проектные менеджеры (IPMA), обладающие практическим опытом реализации проектов различной сложности":
          "Certified project managers (IPMA) work in the OU, possessing practical experience in implementing projects of varying complexity.",
        "Количество реализованных проектов при участии ОУП":
          "Number of projects implemented with the participation of OU",
        проектов: "projects",
        "2023 г. -": "2023 -",
        "2024 г. -": "2024 -",
        "Услуги и компетенции": "Services and Competencies",
        "Разработка и внедрение единых стандартов управления проектами":
          "Development and implementation of unified project management standards",
        "Регистрация авторских прав на собственные разработки КБТУ":
          "Registration of copyright for KBTU's own developments",
        "Обучение проектным подходам при управлении проектами":
          "Training in project approaches to project management",
        "Реализация внешних проектов под ключ":
          "Implementation of turnkey external projects",
        "Управление внутренними проектами и поддержка команд в организации процессов и документации":
          "Management of internal projects and support for teams in organizing processes and documentation",
        "Консалтинг и аудит проектов": "Consulting and project auditing",
        "Подходы к работе": "Approaches to Work",
        "Классические методологии": "Classic Methodologies",
        "Гибкие подходы": "Agile Approaches",
        PMBOK: "PMBOK",
        PRINCE2: "PRINCE2",
        Scrum: "Scrum",
        Kanban: "Kanban",
        "Наши проекты": "Our Projects",
        "Аналитическая цифровая платформа «Умная ферма»":
          "Analytical Digital Platform 'Smart Farm'",
        "Система ориентации (навигации) в здании КБТУ":
          "Orientation (Navigation) System in KBTU Building",
        "Разработка “Цифровой платформы прослеживания семян”":
          "Development of 'Digital Seed Tracking Platform'",
        "Онлайн курс и хакатон по геймификации в партнёрстве ЮНИСЕФ":
          "Online Course and Hackathon on Gamification in Partnership with UNICEF",
        Подробнее: "Learn More",
        "Инструменты и технологии": "Tools and Technologies",
        Инструмент: "Tool",
        Описание: "Description",
        Преимущества: "Advantages",
        "Система управления задачами, популярная среди разработчиков":
          "Task management system popular among developers",
        "Гибкость, мощные возможности для Agile и Scrum":
          "Flexibility, powerful capabilities for Agile and Scrum",
        "Доска для управления задачами с карточками":
          "Board for task management with cards",
        "Простота, удобство для небольших команд":
          "Simplicity, convenience for small teams",
        "Программа для планирования проектов": "Project planning software",
        "Подходит для крупных компаний, аналитика и отчеты":
          "Suitable for large companies, analytics and reports",
        "Органайзер задач с расширенными возможностями":
          "Task organizer with advanced features",
        "Интуитивный интерфейс, интеграции с другими сервисами":
          "Intuitive interface, integrations with other services",
        "Как мы работаем": "How We Work",
        "Контактная информация": "Contact Information",
        "улица Толе Би 59, Алматы 050000": "Tole Bi Street 59, Almaty 050000",
        "8 727 357 42 51": "8 727 357 42 51",
        "info@kbtu.kz": "info@kbtu.kz",
        Имя: "Name",
        Email: "Email",
        Комментарий: "Comment",
        Телефон: "Phone",
        Отправить: "Send",
        Главная: "Home",
        "2025 | Казахстанско-Британский Технический Университет | All rights reserved ®":
          "2025 | Kazakhstan-British Technical University | All rights reserved ®",
        "Написать в Telegram": "Write to Telegram",
      },
    },
    kz: {
      translation: {
        "О нас": "Біз туралы",
        Контакты: "Байланыс",
        Проекты: "Жобалар",
        "Управляем проектами — создаем": "Біз жобаларды басқарамыз — жасаймыз",
        успех: "табыс",
        "Связаться с нами": "Бізбен байланыс",
        "Мы, команда профессионалов, реализуем внутренние и внешние проекты с максимальной эффективностью, используя современные подходы проектного управления":
          "Біз, кәсіби команда, ішкі және сыртқы жобаларды максималды тиімділікпен жүзеге асырамыз, заманауи жобаларды басқару тәсілдерін пайдалана отырып",
        "Проектный офис КБТУ": "КБТУ жобалық офисі",
        "основанный в 2022 году, был создан как внутреннее подразделение университета с целью внедрения и продвижения современных практик и подходов проектного управления в его деятельности.":
          "2022 жылы құрылған, университеттің ішкі бөлімшесі ретінде заманауи жобаларды басқару практикаларын енгізу және ілгерілету мақсатында құрылды.",
        "Наша миссия": "Біздің миссиямыз",
        "Создавать и развивать проектную культуру в университете, внедряя передовые методы управления, способствующие устойчивому развитию и укреплению позиций вуза в образовательной и научной сферах.":
          "Университетте жобалық мәдениетті қалыптастыру және дамыту, тұрақты дамуға ықпал ететін заманауи басқару әдістерін енгізу.",
        "Выступать центром компетенций в области проектного управления, поддерживая и развивая внутренние и внешние инициативы университета.":
          "Жобаларды басқару саласындағы құзыреттілік орталығы ретінде қызмет ету, университеттің ішкі және сыртқы бастамаларын қолдау және дамыту.",
        "Наши цели": "Біздің мақсаттарымыз",
        "Унификация процессов и повышение прозрачности":
          "Процестерді унификациялау және ашықтықты арттыру",
        "Внедрение единого стандарта управления проектами для обеспечения эффективности реализации, прозрачности всех этапов проектной деятельности и снижения рисков, связанных с реализацией проектов.":
          "Жобаларды басқарудың біртұтас стандартын енгізу, жобалық қызметтің барлық кезеңдерінің тиімділігін, ашықтығын қамтамасыз ету және жобаларды жүзеге асырумен байланысты тәуекелдерді азайту.",
        "Развитие культуры проектного управления":
          "Жобаларды басқару мәдениетін дамыту",
        "Формирование и укрепление культуры управления проектами в университете, способствующей повышению профессионального уровня сотрудников и улучшению результатов работы.":
          "Университетте жобаларды басқару мәдениетін қалыптастыру және нығайту, қызметкерлердің кәсіби деңгейін арттыруға және жұмыс нәтижелерін жақсартуға ықпал ету.",
        "Внедрение передовых практик": "Алдыңғы қатарлы практикаларды енгізу",
        "Анализ современных подходов и лучших мировых практик в области управления проектами, их адаптация и интеграция в процессы проектной деятельности КБТУ для достижения новых высот в управлении проектами.":
          "Жобаларды басқару саласындағы заманауи тәсілдер мен әлемдік үздік практикаларды талдау, оларды КБТУ-ның жобалық қызметіне бейімдеу және интеграциялау.",
        "Факты и цифры": "Фактілер мен сандар",
        "В ОУП работают сертифицированные проектные менеджеры (IPMA), обладающие практическим опытом реализации проектов различной сложности":
          "ОУП-те сертификатталған жобалық менеджерлер (IPMA) жұмыс істейді, әртүрлі күрделіліктегі жобаларды жүзеге асыруда практикалық тәжірибесі бар.",
        "Количество реализованных проектов при участии ОУП":
          "ОУП-тің қатысуымен жүзеге асырылған жобалардың саны",
        проектов: "жобалар",
        "2023 г. -": "2023 ж. -",
        "2024 г. -": "2024 ж. -",
        "Услуги и компетенции": "Қызметтер мен құзыреттер",
        "Разработка и внедрение единых стандартов управления проектами":
          "Жобаларды басқарудың біртұтас стандарттарын әзірлеу және енгізу",
        "Регистрация авторских прав на собственные разработки КБТУ":
          "КБТУ-ның өз әзірлемелеріне авторлық құқықтарды тіркеу",
        "Обучение проектным подходам при управлении проектами":
          "Жобаларды басқаруда жобалық тәсілдер бойынша оқыту",
        "Реализация внешних проектов под ключ":
          "Кілтпен сыртқы жобаларды жүзеге асыру",
        "Управление внутренними проектами и поддержка команд в организации процессов и документации":
          "Ішкі жобаларды басқару және командаларды процестер мен құжаттаманы ұйымдастыруда қолдау",
        "Консалтинг и аудит проектов": "Жобаларды консалтинг және аудит",
        "Подходы к работе": "Жұмыс тәсілдері",
        "Классические методологии": "Классикалық әдістемелер",
        "Гибкие подходы": "Икемді тәсілдер",
        PMBOK: "PMBOK",
        PRINCE2: "PRINCE2",
        Scrum: "Scrum",
        Kanban: "Kanban",
        "Наши проекты": "Біздің жобалар",
        "Аналитическая цифровая платформа «Умная ферма»":
          "Аналитикалық цифрлық платформа 'Ақылды ферма'",
        "Система ориентации (навигации) в здании КБТУ":
          "КБТУ ғимаратындағы бағдарлау (навигация) жүйесі",
        "Разработка “Цифровой платформы прослеживания семян”":
          "“Цифрлық тұқымдарды бақылау платформасын” әзірлеу",
        "Онлайн курс и хакатон по геймификации в партнёрстве ЮНИСЕФ":
          "ЮНИСЕФ-пен серіктестік бойынша геймификация тақырыбында онлайн курс және хакатон",
        Подробнее: "Толығырақ",
        "Инструменты и технологии": "Құралдар мен технологиялар",
        Инструмент: "Құрал",
        Описание: "Сипаттама",
        Преимущества: "Артықшылықтар",
        "Система управления задачами, популярная среди разработчиков":
          "Дамытушылар арасында танымал тапсырмаларды басқару жүйесі",
        "Гибкость, мощные возможности для Agile и Scrum":
          "Икемділік, Agile және Scrum үшін қуатты мүмкіндіктер",
        "Доска для управления задачами с карточками":
          "Карталармен тапсырмаларды басқару тақтасы",
        "Простота, удобство для небольших команд":
          "Кішігірім командалар үшін қарапайымдылық, ыңғайлылық",
        "Программа для планирования проектов":
          "Жобаларды жоспарлау бағдарламасы",
        "Подходит для крупных компаний, аналитика и отчеты":
          "Үлкен компанияларға, аналитика мен есептерге жарамды",
        "Органайзер задач с расширенными возможностями":
          "Кеңейтілген мүмкіндіктері бар тапсырмалар ұйымдастырушысы",
        "Интуитивный интерфейс, интеграции с другими сервисами":
          "Интуитивті интерфейс, басқа қызметтермен интеграциялар",
        "Как мы работаем": "Біз қалай жұмыс істейміз",
        "Контактная информация": "Байланыс ақпараттары",
        "улица Толе Би 59, Алматы 050000": "Толе Би көшесі 59, Алматы 050000",
        "8 727 357 42 51": "8 727 357 42 51",
        "info@kbtu.kz": "info@kbtu.kz",
        Имя: "Аты",
        Email: "Электрондық пошта",
        Комментарий: "Пікір",
        Телефон: "Телефон",
        Отправить: "Жіберу",
        Главная: "Басты бет",
        "2025 | Казахстанско-Британский Технический Университет | All rights reserved ®":
          "2025 | Қазақстан-Британ техникалық университеті | Барлық құқықтар қорғалған ®",
        "Написать в Telegram": "Telegram-да жазу",
      },
    },
  },
  lng: "ru",
  fallbackLng: "en",
  interpolation: {
    escapeValue: false,
  },
});

export default i18n;
